#задача 1
a = "2.1"
b = "1.04"
pi = (float(a) + float(b))
print(pi)


#задача 2
a = "hello"
b = 123
c = 0
d = -1
f ="-1" 
a = bool(a)
b = bool(b)
c = bool(c)
d = bool(d)
f = bool(f)
print(a,b,c,d,f)


#задача 3
print("i" ,"like" ,"Python", sep = "***")


#задача 4
# sep =  необязательный параметр sep команды print() позволяет установить строку, с помощью которой будут разделены аргументы при печати.
# end = Если перевод строки делать не нужно или требуется указать специальное окончание, то следует явно указать значение для параметра end.



#задача 5
# -50



#задача 6

a = int(input("Введите стоимость монитора: "))
b = int(input("Введите стоимость системного блока: "))
c = int(input("Введите стоимость клавитуры: "))
d = int(input("Введите стоимость мышки: "))
e = 3 * (a + b + c +d)
print("Общая стоимость: " + str(e))


#задача 7
a = input("Введите число : ")
print("Следующее за числом " + a + " число: )
b = input("Введите число 10: ")
print("Для числа " + b + " предыдущее число:9")
